"use strict";

alert("Задание 1");

var a = 1, b = 1, c, d;
/*
переменная а принимает значение 1,
переменная b принимает значение 1,
переменная с принимает значение undefined так как не заданно,
переменная d принимает значение undefined так как не заданно,
*/
c = ++a;
alert(c);
//с = 2, так как оператор инкремента(++) стоит в начале, то возвращает значение переменной а увеличенное на 1. (Префиксная форма)
d = b++;
alert(d);
/* 
d = 1, так как оператор инкремента(++) стоит после, то переменная b возвращает переменной d свое значение, а только потом увеличивает свое значение на 1. (Постфиксная форма)
 так получается, что после этих операций переменные будут иметь следующие значения: 
 a = 2;
 b = 2;
 c = 2;
 d = 1;
*/
c = (2 + ++a);
alert(c);
//c = (2 + (2+1)); переменная a со значением 2 увеличилась на 1.
d = (2 + b++);
alert(d);
//d = (2 + 2); переменная b имеет значение 2 которое и вернет переменной d, и только после этого увеличит свое значение на 1.
alert(a);
//а = 3. Изначально имело значение 1 и была прибавленна 1-ца два раза. и каждый раз вовращала себя уже с прибавленной 1.
alert(b);
//b = 3. Изначально имело значение 1 и была прибавленна 1-ца два раза. Однако получала +1 уже после того как возвращала переменным свое значение.

