"use strict";

alert("Задание 6");

/*
Программа должна спросить у пользователя число, это будет количество денег, которое он хочет 
положить на счет в банке. Затем программа должна выдать примерно такое сообщение:
"Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101.
"Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020.
"Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104.
То есть ваша задача выводить слово «рубль» в правильном падеже, в зависимости от введенного 
числа.
*/

/*
Запрашиваю у пользователя сумму, при этом запрос повторяеться, если пользователь ввел некоректные данные.
Если пользователь ничего не вводит это эквивалентно тому, что он ввел 0. Не вижу смысла этой проверки
так как по логике программы пользователь положит 0 рублей на счет.
*/
let userInput;
do {
	userInput = +prompt("Введите колличество денег, которое вы хотите положить на счет");
} while (isNaN(userInput) || userInput < 0);

//Привожу значение к срочному типу данных
const str = String(userInput);

//Узнаю длину массива.
const arrLengs = str.length;

//Узнаю порядковый номер последнего элемента в массиве.
const arrNum = arrLengs - 1;

//Записываю последний элемент в переменную.
let lastChar = str[arrNum];

/*
В случае если на конце введенного числа будет 11, то подеж будет отличаться. Делаем проверку.
Можно заменить на 
(str[arrNum] === "1" && str[arrNum - 1] === "1") ? lastChar = "11" : lastChar = str[arrNum];
И здесь вопрос. Возможно ли использовать вариант кода через if...else... всегда, не используя тернарный оператор вообще?
Дело в том что мой глаз очень плохо его читает и я делаю паузу что бы понять где есть что, а через if... else сразу все вижу.
Или лучше заставлять себя писать тернарный оператор что бы с опытом хорошо его читать? 
*/
if (str[arrNum] === "1" && str[arrNum - 1] === "1") {
	lastChar = "11";
} else {
	lastChar = str[arrNum];
}

//Вывожу результат зависящий от проверок.
switch (lastChar) {
	case "1":
		alert(`Вы положили ${userInput} рубль`);
		break;
	case "2":
	case "3":
	case "4":
		alert(`Вы положили ${userInput} рубля`);
		break;
	case "0":
	case "5":
	case "6":
	case "7":
	case "8":
	case "9":
	case "11":
		alert(`Вы положили ${userInput} рублей`);
		break;
}

/*
Не понял для чего и куда нужно вставить .charAt(). Мы же в любом случае не знаем длину массива и нам нужна проверка .length - 1
Если я правильно понял то у меня будет:

let lastChar = str.charAt(arrNum);

вместо

let lastChar = str[arrNum];

Для чего? Объясните, пожалуйста, что я упустил.
*/

//---------------------------------------------------------

alert("Задание 6, вариант 2");

/**
 * Функция запрашивает у пользователя число до тех пор пока не будет введенно положительное число цифрами.
 * @returns {string} Возвращает число в качестве строки
 */
function getUserInpit() {
	//Запрашиваем у пользователя число
	const answer = +prompt("Введите колличество денег, которое вы хотите положить на счет.");
	//Если число введено не цифрами
	if (isNaN(answer)) {
		alert("Введите число цифрами.")
		getUserInpit();
	}
	//Если введено отрицательное число
	else if (answer < 0) {
		alert("Введите положительное число");
		getUserInpit();
	}
	//Если ввод верный возвращаем число преопразованное в строчный тип данных
	else {
		return String(answer);
	}
}

/**
 * Функция подставляет нужный подеж слову рубль в зависимости от числа
 */
function getRightСase(a) {
	//Находим индекс последнего элемента.
	let b = a.length - 1;
	//Находим индекс предпоследнего элемента.
	let i = a.length - 2;
	//Если последняя цифра 1, а предпоследняя не 1(тоесть число не заканчиваеться на 11)
	if (a[b] === "1" && a[i] !== "1") {
		return "рубль!";
	}
	//Если последнии цифры 2, 3 или 4
	else if (a[b] === "2" || a[b] === "3" || a[b] === "4") {
		return "рубля!"
	}
	//Во всех остальных случаях
	else {
		return "рублей!";
	}
}

//Записываем результат функции в переменную
const userInput2 = getUserInpit();
alert(`Вы положили ${userInput2} ${getRightСase(userInput2)}`);