"use strict";

//---------------------------------------------------
/*
1. Первые два операнда числовой тип, поэтому оператор их складывает. Получаем 20.
2. 3 операнд строчный тип, если попытаться сложить число со строкой, то будет выполняться склеивание.
3. Получаем 2010 
*/
let result1 = 10 + 10 + "10";
console.log(result1);

//---------------------------------------------------
/*
1. Первый операнд число, второй - строка. Третий - число.
2. Происходит конкатенация. Первое число склеиваеться со строкой, и они склеиваются со вторым числом.
3. получаем 101010
*/
let result2 = 10 + "10" + 10;
console.log(result2);

//---------------------------------------------------
/*
1. Данный пример похож на первый, но перед 3-им операндом строчного типа стоит унарный +.
2. Данное вырожение идентично 10 + 10 + Number("10") или 10 + 10 + parseInt("10")
3. + перед строчным типом пытаеться привести строку к числу.
4. Получаем 30
*/
let result3 = 10 + 10 + +"10";
console.log(result3);

//---------------------------------------------------
/*
1. Если один из операндов является числом или логическим, операнды преобразуются в числа, если это возможно;
2. Вычитание работает только с числами, пустаня строка приводиться к 0.
3. Так у нас получаеться 10 / -0
4. В программирование деление на 0 дает бесконечность, а так как у нас унарный - перед 0, то значение получается отрицательным.
5. Результат -Infinity
*/
let result4 = 10 / -"";
console.log(result4);

//---------------------------------------------------
/*
1. Мы уже выяснили, что + перед строкой пытаеться привести значение к числу.
2. Поучаеться 10 / 2,5 и долджно получиться 4.
3. Но в Js нельзя использовать запятую для отделения дробной части. На ее месте должна быть точка.
4. В нашем примере +"2,5" поучит NaN
5. Любая операция с NaN будет NaN
*/
let result5 = 10 / +"2,5";
console.log(result5);


//Надеюсь не напутал с терминами :-)