"use strict";

/*
С помощью цикла for написать алгоритм для вывода чисел (выводите в консоль, с помощью console.log) от 0 до 10
включительно, чтобы результат выглядел так:
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
…
10 – четное число
Для решения этой задачи используйте остаток от деления на 2, подробнее здесь
*/

//Создаем цикл перебирающий значения от 0 до 10
for (let i = 0; i <= 10; i++) {
	//Создаем проверку если число 0
	if (i === 0) {
		console.log("0 - Это ноль")
		continue
	}
	//Создаем проверку на остаток от деления на 2, если остаток 0 это четное число
	else if (i % 2 === 0) {
		console.log(`${i} - четное число`)
		continue
	}
	//Создаем проверку на остаток от деления на 2, если остаток 1 это нечетное число
	//Можно записать как (i % 2 !== 0), но разници не вижу
	else if (i % 2 !== 0) {
		console.log(`${i} - нечетное число`)
		continue
	}
}

