"use strict";

//В отсутствии времени подглядел логику у вас с видео по дз. Сделал сам, но код и логика ваша.

let game = {
    //Начальный счет
    score: 0,
    //Индек вопроса из массива questions
    questionIndex: 0,
    //Запускаем игру
    run() {
        //Делаем проверку, если индекс вопроса не существует, значит вопросы закончились.
        //Сообщаем это игроку, показываем его счет.
        //Сразу обнуляем индекс и счет. Спрашиваем поиграть еще и если True запускаем метод run().
        if (!this.isQuestionExists()) {
            alert(`Поздравляю, Вы ответили на все вопросы \nВаш счет ${this.score}`);
            this.score = 0;
            this.questionIndex = 0;
            if (confirm("Повторим?")) {
                this.run();
            } else {
                console.log("Спасибо за игру. Чтобы начать игру наберите game.run() и нажмите Enter")
                return;
            }
        }
        //Если проверка ложна задаем вопрос
        //Вызываем функцию и записываем ее результат в переменную
        let result = leader.askQuestion(questions[this.questionIndex]);
        //Если ответ верный(true) добавляем +1 к счетчику правильных ответов
        if (result) {
            this.score++;
        }
        //Не зависимо от верности ответа увеличиваем индекс вопроса и запускаем метод по новой
        this.questionIndex++;
        this.run();
    },
    //Метод проверяет индекс массива и если его не существует возвращает false
    isQuestionExists() {
        return questions[this.questionIndex] !== undefined;
    },

    init() {
        console.log("Добро пожаловать в игру \"Кто хочет стать миллионером\"")
        console.log("Чтобы начать игру наберите game.run() и нажмите Enter");
    }
};

game.init();
